total_food = int(input())#е общото количество храна, което ресторантът има на разположение за деня
# е списък, който съдържа поръчките на клиентите.
orders = list(map(int, input().split()))
#Намира най-голямата поръчка
max_order = max(orders)

for order in orders:
    #програмата проверява дали общото количество храна, което остава, е по-голямо или равно на текущата поръчка
    if total_food >= order:
        #Ако условието е истина, тя изпълнява поръчката, като намалява общото количество храна с количеството на поръчката
        total_food -= order
    else:
        break

print(max_order)